#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-cloudfront.aws_acm_certificate.galaxyletter_com will be created
  + resource "aws_acm_certificate" "galaxyletter_com" {
      + arn                       = (known after apply)
      + domain_name               = "galaxyletter.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + subject_alternative_names = [
          + "*.galaxyletter.com",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.aws-cloudfront.aws_acm_certificate_validation.cert_galaxyletter_com will be created
  + resource "aws_acm_certificate_validation" "cert_galaxyletter_com" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.aws-cloudfront.aws_cloudfront_distribution.galaxyletter_com will be created
  + resource "aws_cloudfront_distribution" "galaxyletter_com" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "galaxyletter.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "S3-galaxyletter.com"
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "galaxyletter.com.s3-website-us-east-1.amazonaws.com"
          + origin_id   = "S3-galaxyletter.com"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.aws-cloudfront.aws_route53_record.cert_validation_galaxyletter_com will be created
  + resource "aws_route53_record" "cert_validation_galaxyletter_com" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z3S70Y7U7DI2H0"
    }

  # module.aws-route-53.aws_route53_record.ja_galaxyletter_com_CNAME will be created
  + resource "aws_route53_record" "ja_galaxyletter_com_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ja.galaxyletter.com"
      + records         = [
          + "galaxyletter.github.io",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z3S70Y7U7DI2H0"
    }

  # module.aws-s3-bucket.data.aws_iam_policy_document.s3_policy_galaxyletter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy_galaxyletter"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::galaxyletter.com/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws-s3-bucket.aws_cloudfront_origin_access_identity.origin_access_identity_galaxyletter will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity_galaxyletter" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "galaxyletter.com"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.aws-s3-bucket.aws_s3_bucket.galaxyletter_com will be updated in-place
  ~ resource "aws_s3_bucket" "galaxyletter_com" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::galaxyletter.com"
        bucket                      = "galaxyletter.com"
        bucket_domain_name          = "galaxyletter.com.s3.amazonaws.com"
        bucket_regional_domain_name = "galaxyletter.com.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "galaxyletter.com"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}
        website_domain              = "s3-website-us-east-1.amazonaws.com"
        website_endpoint            = "galaxyletter.com.s3-website-us-east-1.amazonaws.com"

        versioning {
            enabled    = false
            mfa_delete = false
        }

        website {
            redirect_all_requests_to = "https://www.galaxyletter.com"
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket_policy.galaxyletter_com will be created
  + resource "aws_s3_bucket_policy" "galaxyletter_com" {
      + bucket = "galaxyletter.com"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
